# ~/dotfiles/Brewfile
# Install: brew bundle --file=~/dotfiles/Brewfile

# ── Version Manager ──────────────────────────────────────────
brew "mise"                   # Universal version manager (replaces nvm, pyenv, asdf)

# ── Modern CLI Replacements ──────────────────────────────────
brew "eza"                    # Modern ls with git integration
brew "bat"                    # Cat with syntax highlighting
brew "fd"                     # Modern find
brew "ripgrep"                # Modern grep (rg)
brew "zoxide"                 # Smart cd that learns your habits
brew "delta"                  # Beautiful git diffs

# ── Productivity ─────────────────────────────────────────────
brew "fzf"                    # Fuzzy finder for everything
brew "tmux"                   # Terminal multiplexer
brew "lazygit"                # Terminal UI for git
brew "htop"                   # Interactive process viewer
brew "jq"                     # JSON processor
brew "yq"                     # YAML processor
brew "watch"                  # Run commands periodically
brew "tree"                   # Directory tree viewer
brew "tldr"                   # Simplified man pages
brew "direnv"                 # Per-directory env variables

# ── Containers & Kubernetes ──────────────────────────────────
cask "orbstack"               # Docker & Linux VM (lightweight Docker Desktop replacement)
brew "kind"                   # Kubernetes IN Docker (local clusters)
brew "kubectl"                # Kubernetes CLI
brew "kubectx"                # Fast context/namespace switching
brew "helm"                   # Kubernetes package manager
brew "k9s"                    # Terminal UI for Kubernetes
brew "stern"                  # Multi-pod log tailing
brew "kustomize"              # Kubernetes manifest customization

# ── Cloud CLIs ───────────────────────────────────────────────
brew "awscli"                 # AWS CLI
brew "granted"                # Multi-account AWS role switching (assume command)
# brew "azure-cli"            # Uncomment if needed
# cask "google-cloud-sdk"     # Uncomment if needed

# ── Networking ─────────────────────────────────────────────
brew "cloudflared"               # Cloudflare Tunnel client

# ── Infrastructure ───────────────────────────────────────────
brew "terraform"              # Infrastructure as Code
brew "terragrunt"             # Terraform wrapper
brew "terraform-docs"         # Auto-generate TF module docs
brew "tfsec"                  # Terraform security scanner
brew "checkov"                # IaC security scanner (TF, K8s, Dockerfile)
brew "infracost"              # Cloud cost estimates for Terraform

# ── Helm Tooling ────────────────────────────────────────────
brew "helmfile"               # Declarative Helm chart management
brew "helm-docs"              # Auto-generate Helm chart docs
brew "chart-testing"          # Helm chart lint & test (ct)

# ── Pre-commit ──────────────────────────────────────────────
brew "pre-commit"             # Git pre-commit hook framework

# ── Linters ─────────────────────────────────────────────────
brew "yamllint"               # YAML linter
brew "shellcheck"             # Shell script linter
brew "hadolint"               # Dockerfile linter
brew "tflint"                 # Terraform linter

# ── Editor ─────────────────────────────────────────────────
brew "neovim"                 # Hyperextensible Vim-based editor

# ── Shell ────────────────────────────────────────────────────
brew "starship"               # Cross-shell prompt

# ── Git ──────────────────────────────────────────────────────
brew "git"                    # Latest git
brew "gh"                     # GitHub CLI

# ── Terminal ─────────────────────────────────────────────────
cask "iterm2"                 # Terminal emulator

# ── IDEs / Editors ──────────────────────────────────────────
cask "visual-studio-code"     # VS Code
cask "windsurf"               # Windsurf (AI-powered editor)

# ── Security / Identity ────────────────────────────────────
cask "1password-cli"            # 1Password CLI (op)

# ── AI ───────────────────────────────────────────────────────
# claude-code: install via npm (npm i -g @anthropic-ai/claude-code)
brew "gemini-cli"             # Google Gemini CLI

# ── Window Management ───────────────────────────────────────
cask "rectangle"              # Window manager (snap & tile)

# ── Fonts (Nerd Fonts for icons in eza, starship, etc.) ──────
cask "font-jetbrains-mono-nerd-font"
cask "font-fira-code-nerd-font"
